# Ввод и вывод данных. Преобразование типов


# print("Введите a")
# a = int(input())
# print("Введите b")
# b = int(input())

# print(a, b)
# print('{} - {}'.format(a, b))
# print(f'{a} - {b}')

# print(a, " + ", b, " = ", a+b)   # выведет 1020, потому что по умолчанию input() работает со строками => добавим int() и преобразуем в число => 30

# print("Введите n")
# n = float(input())
# print("Введите m")
# m = float(input())
# print(n, " + ", m, " = ", n+m)


# Арифметические операции


# +, -, *, /, %, //,**
# Приоритет операций
# **, ⊕, ⊖,*, /, //, %, +, -

# c = 3
# d = 2
# e = c // d # деление в целых числах
# print(e)
# g = c ** d # степень
# print(g)

# f = 1.3
# h = 3
# i = f * h
# print(i) # 3.9000000000000004 => из-за особенностей хранения вещественных чисел в  python
# print(round(i, 3))


# Сокращенные операции присваивания

a = 3
a +=5
print(a) # 8
